rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_SCB.h
/*
** ###################################################################
**     Processor:           S32M24x_M4
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32M24x RM Rev.1 Draft F
**     Version:             rev. 1.0, 2021-02-18
**     Build:               b210218
**
**     Abstract:
**         Peripheral Access Layer for S32M24x_M4
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2021 NXP
**
**     NXP Confidential. This software is owned or controlled by NXP and may only be
**     used strictly in accordance with the applicable license terms. By expressly
**     accepting such terms or by downloading, installing, activating and/or otherwise
**     using the software, you are agreeing that you have read, and that you agree to
**     comply with and are bound by, such license terms. If you do not agree to be
**     bound by the applicable license terms, then you may not retain, install,
**     activate or otherwise use the software. The production use license in
**     Section 2.3 is expressly granted for this software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32M24x_SCB.h
 * @version 1.0
 * @date 2021-02-18
 * @brief Peripheral Access Layer for S32M24x_SCB
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
 * The SoC header defines typedef for all modules.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
 * The SoC header defines macros for all modules and registers.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
 * These are generated macros used for accessing the bit-fields from registers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.1, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.2, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.4, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.5, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
 * This type qualifier is needed to ensure correct I/O access and addressing.
 */

/* Prevention from multiple including the same memory map */
#if !defined(S32M24x_SCB_H_) /* Check if memory map has not been already included */
#define S32M24x_SCB_H_

#include "S32M24x_COMMON.h"

/* ----------------------------------------------------------------------------
   -- S32_SCB Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup S32_SCB_Peripheral_Access_Layer S32_SCB Peripheral Access Layer
 * @{
 */

/** S32_SCB - Size of Registers Arrays */

/** S32_SCB - Register Layout Typedef */
typedef struct {
    uint8_t RESERVED_0[8];
    __IO uint32_t ACTLR; /**< Auxiliary Control Register,, offset: 0x8 */
    uint8_t RESERVED_1[3316];
    __I uint32_t CPUID;  /**< CPUID Base Register, offset: 0xD00 */
    __IO uint32_t ICSR;  /**< Interrupt Control and State Register, offset: 0xD04 */
    __IO uint32_t VTOR;  /**< Vector Table Offset Register, offset: 0xD08 */
    __IO uint32_t AIRCR; /**< Application Interrupt and Reset Control Register, offset: 0xD0C */
    __IO uint32_t SCR;   /**< System Control Register, offset: 0xD10 */
    __IO uint32_t CCR;   /**< Configuration and Control Register, offset: 0xD14 */
    __IO uint32_t SHPR1; /**< System Handler Priority Register 1, offset: 0xD18 */
    __IO uint32_t SHPR2; /**< System Handler Priority Register 2, offset: 0xD1C */
    __IO uint32_t SHPR3; /**< System Handler Priority Register 3, offset: 0xD20 */
    __IO uint32_t SHCSR; /**< System Handler Control and State Register, offset: 0xD24 */
    __IO uint32_t CFSR;  /**< Configurable Fault Status Registers, offset: 0xD28 */
    __IO uint32_t HFSR;  /**< HardFault Status register, offset: 0xD2C */
    __IO uint32_t DFSR;  /**< Debug Fault Status Register, offset: 0xD30 */
    __IO uint32_t MMFAR; /**< MemManage Address Register, offset: 0xD34 */
    __IO uint32_t BFAR;  /**< BusFault Address Register, offset: 0xD38 */
    __IO uint32_t AFSR;  /**< Auxiliary Fault Status Register, offset: 0xD3C */
    uint8_t RESERVED_2[72];
    __IO uint32_t CPACR; /**< Coprocessor Access Control Register, offset: 0xD88 */
    uint8_t RESERVED_3[424];
    __IO uint32_t FPCCR;  /**< Floating-point Context Control Register, offset: 0xF34 */
    __IO uint32_t FPCAR;  /**< Floating-point Context Address Register, offset: 0xF38 */
    __IO uint32_t FPDSCR; /**< Floating-point Default Status Control Register, offset: 0xF3C */
} S32_SCB_Type, *S32_SCB_MemMapPtr;

/** Number of instances of the S32_SCB module. */
#define S32_SCB_INSTANCE_COUNT (1u)

/* S32_SCB - Peripheral instance base addresses */
/** Peripheral S32_SCB base address */
#define S32_SCB_BASE (0xE000E000u)
/** Peripheral S32_SCB base pointer */
#define S32_SCB ((S32_SCB_Type*)S32_SCB_BASE)
/** Array initializer of S32_SCB peripheral base addresses */
#define S32_SCB_BASE_ADDRS                                                                         \
    {                                                                                              \
        S32_SCB_BASE                                                                               \
    }
/** Array initializer of S32_SCB peripheral base pointers */
#define S32_SCB_BASE_PTRS                                                                          \
    {                                                                                              \
        S32_SCB                                                                                    \
    }

/* ----------------------------------------------------------------------------
   -- S32_SCB Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup S32_SCB_Register_Masks S32_SCB Register Masks
 * @{
 */

